docs/pages/algorithm/binary_search.html
---
layout: default
title: Binary Search
nav_exclude: true
---
<div id="outline-container-org8961627" class="outline-2">
<h2 id="org8961627"><span class="section-number-2">1.</span> description</h2>
<div class="outline-text-2" id="text-1">
<p>
Binary search the target in a sorted array or a solution for a monotonic problem.
</p>


<p>
C++ lower<sub>bound</sub> and upper<sub>bound</sub> assume the array to be sorted in non-decreasing order.
</p>

<p>
Usually when doing binary search, you need to following the order of array. For example, if the array is in increasing order, we usually find the one that is greater than sth.
It&rsquo;s not possible to use binary search to find the one that is smaller than sth.
</p>

<p>
So it does not make sense when you perform lower<sub>bound</sub>(arr.begin(), arr.end(), target) on an increasing array,
which means find the first element that is &gt;= target in an decreasing order array, which violate the searching order.
</p>

<p>
The <code>lower_bound(arr.begin(), arr.end(), target, greater&lt;int&gt;())</code> in desendign order array, is used to find the first element &lt;= target. upper<sub>bound</sub> is used to find the first element &lt; target.
</p>
</div>
</div>
<div id="outline-container-orgad6b131" class="outline-2">
<h2 id="orgad6b131"><span class="section-number-2">2.</span> usage</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5166bb7" class="outline-3">
<h3 id="org5166bb7"><span class="section-number-3">2.1.</span> asending ordered array</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org5b2fd6c" class="outline-4">
<h4 id="org5b2fd6c"><span class="section-number-4">2.1.1.</span> first greater or equal (lower bound)</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
lower<sub>bound</sub>(nums.begin(), nums.end(), target);
<a href="https://www.bilibili.com/video/BV1AP41137w7/?vd_source=65691673f75c70bd7052dc22994205cc">Three ways to write lower bound</a>
No matter how we represent the binary search window like in [left, right], [left, right) or (left, right).
The core idea is shrink the window until the window is empty. (We checked all the elements if the window is empty).
This is important to control the while loop condition.
</p>
</div>
<div id="outline-container-org085e2c3" class="outline-5">
<h5 id="org085e2c3"><span class="section-number-5">2.1.1.1.</span> [left, right], both side are closed</h5>
<div class="outline-text-5" id="text-2-1-1-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[left, right] contains one possible answer, or no answer</span>
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size()-<span style="color: #da8548; font-weight: bold;">1</span>;
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">when left -- right, [left, right] there is one element left, still need to check</span>
  <span style="color: #51afef;">while</span>(left &lt;= right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &lt; target) {
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">invariant: those from [0, left-1] are marked as red ==&gt; not valid answer</span>
    }
    <span style="color: #51afef;">else</span> {
      right = mid - <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">invariant: those from [right+1, end] are marked as blue ==&gt; valid answer</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">after the loop, left must be in the right of right</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">we can return left of right + 1</span>
  <span style="color: #51afef;">return</span> left;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org7fa4e36" class="outline-5">
<h5 id="org7fa4e36"><span class="section-number-5">2.1.1.2.</span> [left, right), left side is closed while right side is open</h5>
<div class="outline-text-5" id="text-2-1-1-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size();

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">if left == right, [left, right) there is no elements in the window, we processed all the elements and do not need to check</span>
  <span style="color: #51afef;">while</span>(left &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &lt; target) {
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>;    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0, left-1] is those &lt;</span>
    }
    <span style="color: #51afef;">else</span> {
      right = mid;       <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right, end] are those &gt;=</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">after the loop, left will be the same as right, which has the answer</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">return left or right</span>
  <span style="color: #51afef;">return</span> right;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf132e01" class="outline-5">
<h5 id="orgf132e01"><span class="section-number-5">2.1.1.3.</span> (left, right), noth side are open</h5>
<div class="outline-text-5" id="text-2-1-1-3">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = -<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">right</span> = nums.size();

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">when left+1 == right (left, right), there is no elements in the window, do not need to check</span>
  <span style="color: #51afef;">while</span>(left+<span style="color: #da8548; font-weight: bold;">1</span> &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &lt; target) {
      left = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0, left] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      right = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right, end..] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">after the loop left+1 == right, we processed all the elements</span>
  <span style="color: #51afef;">return</span> right;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge7d584e" class="outline-4">
<h4 id="orge7d584e"><span class="section-number-4">2.1.2.</span> first greater (upper bound)</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
upper<sub>bound</sub>(nums.begin(), nums.end(), target)
</p>
</div>
<div id="outline-container-org31dfa1b" class="outline-5">
<h5 id="org31dfa1b"><span class="section-number-5">2.1.2.1.</span> [left, right]</h5>
<div class="outline-text-5" id="text-2-1-2-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size()-<span style="color: #da8548; font-weight: bold;">1</span>;
  <span style="color: #51afef;">while</span>(left&lt;=right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &lt;= target) { <span style="color: #5B6268;">// </span><span style="color: #5B6268;">&lt;= will be ignored</span>
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0, left-1] are marked as red</span>
    }
    <span style="color: #51afef;">else</span> {
      right = mid - <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right+1, ..] are marked as blue</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left is in the right of right pointer</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left and right+1 are valid answer, return either one is ok</span>
  <span style="color: #51afef;">return</span> left;
}
</pre>
</div>
</div>
</div>
