org/pages/algorithm/binary_search.org
**** [left, right)
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = 0, right = nums.size();
  while(left < right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] <= target) {
      left = mid + 1; // [0, left-1] are invalid
    }
    else {
      right = mid; // [right ... end] are valid
    }
  }
  // now left == right, we can return either of these
  return left;
}
#+end_src
**** (left, right)
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = -1, right = nums.size();
  while(left+1 < right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] <= target) {
      left = mid; // [0, left] are invalid
    }
    else {
      right = mid; // [right .. ] are valid
    }
  }
  // now left+1 == right, return left+1 and right are ok
  return right;
}
#+end_src

*** last smaller or equal
upper_bound(nums.begin(), nums.end(), target) - 1
**** [left, right]
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = 0, right = nums.size()-1;
  while(left <= right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] > target) {
      right = mid - 1; // [right+1 ... end] are invalid
    }
    else {
      left = mid + 1; // [0...left-1] are valid
    }
  }

  // now left is in the right of right
  // return left-1 or right is valid, return any is ok
  return right;
}
#+end_src
**** [left, right)
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = 0, right = nums.size();
  while(left < right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] > target) {
      right = mid; // [right,...] are invalid
    }
    else {
      left = mid + 1; // [0 ... left-1] are valid
    }
  }

  // now left is in the right of left == right
  // left-1 and right-1 are valid, return either is ok
  return left - 1;
}
#+end_src
**** (left, right)
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = -1, right = nums.size();
  while(left+1 < right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] > target) {
      right = mid; // [right end] are invalid
    }
    else {
      left = mid; // [0..left] are valid
    }
  }

  // now left+1 == right
  // left and right - 1 are valid, return anyone is ok
  return left;
}
#+end_src

*** last smaller
lower_bound(nums.begin(), nums.end(), target) - 1
**** [left, right]
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = 0, right = nums.size()-1;
  while(left<=right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] >= target) {
      right = mid - 1; // [right+1 .. ] are invalid
    }
    else {
      left = mid + 1; // [0 ... left-1] are valid
    }
  }

  // now left is in the right of left
  // left -1 and right are valid, we can return either
  return right;
}
#+end_src
