docs/pages/algorithm/binary_search.html
<div id="outline-container-orgae016fe" class="outline-5">
<h5 id="orgae016fe"><span class="section-number-5">2.1.2.2.</span> [left, right)</h5>
<div class="outline-text-5" id="text-2-1-2-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size();
  <span style="color: #51afef;">while</span>(left &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &lt;= target) {
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0, left-1] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      right = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right ... end] are valid</span>
    }
  }
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left == right, we can return either of these</span>
  <span style="color: #51afef;">return</span> left;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga524656" class="outline-5">
<h5 id="orga524656"><span class="section-number-5">2.1.2.3.</span> (left, right)</h5>
<div class="outline-text-5" id="text-2-1-2-3">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = -<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">right</span> = nums.size();
  <span style="color: #51afef;">while</span>(left+<span style="color: #da8548; font-weight: bold;">1</span> &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &lt;= target) {
      left = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0, left] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      right = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right .. ] are valid</span>
    }
  }
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left+1 == right, return left+1 and right are ok</span>
  <span style="color: #51afef;">return</span> right;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org866de6a" class="outline-4">
<h4 id="org866de6a"><span class="section-number-4">2.1.3.</span> last smaller or equal</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
upper<sub>bound</sub>(nums.begin(), nums.end(), target) - 1
</p>
</div>
<div id="outline-container-org56199cb" class="outline-5">
<h5 id="org56199cb"><span class="section-number-5">2.1.3.1.</span> [left, right]</h5>
<div class="outline-text-5" id="text-2-1-3-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size()-<span style="color: #da8548; font-weight: bold;">1</span>;
  <span style="color: #51afef;">while</span>(left &lt;= right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &gt; target) {
      right = mid - <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right+1 ... end] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0...left-1] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left is in the right of right</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">return left-1 or right is valid, return any is ok</span>
  <span style="color: #51afef;">return</span> right;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0db1c2" class="outline-5">
<h5 id="orge0db1c2"><span class="section-number-5">2.1.3.2.</span> [left, right)</h5>
<div class="outline-text-5" id="text-2-1-3-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size();
  <span style="color: #51afef;">while</span>(left &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &gt; target) {
      right = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right,...] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0 ... left-1] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left is in the right of left == right</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left-1 and right-1 are valid, return either is ok</span>
  <span style="color: #51afef;">return</span> left - <span style="color: #da8548; font-weight: bold;">1</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf077deb" class="outline-5">
<h5 id="orgf077deb"><span class="section-number-5">2.1.3.3.</span> (left, right)</h5>
<div class="outline-text-5" id="text-2-1-3-3">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = -<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">right</span> = nums.size();
  <span style="color: #51afef;">while</span>(left+<span style="color: #da8548; font-weight: bold;">1</span> &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &gt; target) {
      right = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right end] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      left = mid; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0..left] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left+1 == right</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left and right - 1 are valid, return anyone is ok</span>
  <span style="color: #51afef;">return</span> left;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga9ef8b9" class="outline-4">
<h4 id="orga9ef8b9"><span class="section-number-4">2.1.4.</span> last smaller</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
lower<sub>bound</sub>(nums.begin(), nums.end(), target) - 1
</p>
</div>
<div id="outline-container-org451dafb" class="outline-5">
<h5 id="org451dafb"><span class="section-number-5">2.1.4.1.</span> [left, right]</h5>
<div class="outline-text-5" id="text-2-1-4-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size()-<span style="color: #da8548; font-weight: bold;">1</span>;
  <span style="color: #51afef;">while</span>(left&lt;=right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &gt;= target) {
      right = mid - <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right+1 .. ] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0 ... left-1] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left is in the right of left</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left -1 and right are valid, we can return either</span>
  <span style="color: #51afef;">return</span> right;
}
</pre>
</div>
</div>
</div>
