org/pages/algorithm/binary_search.org
**** [left, right)
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = 0, right = nums.size();
  while(left < right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] >= target) {
      right = mid;     // [right ... ] are invalid
    }
    else {
      left = mid + 1;  // [0 .. left-1] are valid
    }
  }

  // now left == right
  // left - 1 or right - 1 are valid
  return left - 1;
}
#+end_src

 (left, right)
#+begin_src cpp
int search(vector<int>& nums, int target) {
  int left = -1, right = nums.size();
  while(left+1 < right) {
    int mid = left + (right - left) / 2;
    if(nums[mid] >= target) {
      right = mid;  // [right ... ] are invalid
    }
    else {
      left = mid;  // [0...left] are valid
    }
  }

  // now left+1 = right
  // left and right - 1 are valid, return any is ok
  return left;
}
#+end_src

*** first smaller (does not make sense to use binary search)
*** first smaller or equal (does not make sense to use binary search)
** desending ordered array
for desending order, we need to overwrite the comparator operator
*** first smaller or equal (lower bound)
lower_bound(nums.begin(), nums.end(), target, greater<int>())
*** first smaller (upper bound)
upper_bound(nums.begin(), nums.end(), target, greater<int>())
*** last greater or eqaul
upper_bound(nums.begin(), nums.end(), greater<int>()) - 1
*** last greater
lower_bound(nums.begin(), nums.end(), greater<int>)
*** first greater (does not make sense to use binary search)
*** first greater or equal (does not make sense to use binary search)
** paramatric search
Parametric Search is a technique where you use binary search to find the smallest or largest value (parameter) that satisfies a given condition — even when the value itself isn't in a list or array.
For example, you want find the largest value k that can be used to finish something.
You can one helper function is_ok(k), which returns true if k can be used to finish that thing

(left, right)
#+begin_src cpp
int search() {
  int left = -1 (or other impossible value), right = INT_MAX (or other impossible value);
  while(left+1 < right) {
    int mid = left + (left - right) / 2;
    if(!is_ok(mid)) {
      right = mid;  // [right ... ] are invalid
    }
    else {
      left = mid // [0.. left] are valid
    }
  }

  // now left+1 == right
  // left and right - 1 is valid, return either is ok
  return left;
}
#+end_src
