docs/pages/algorithm/binary_search.html
<div id="outline-container-orgd4bb594" class="outline-5">
<h5 id="orgd4bb594"><span class="section-number-5">2.1.4.2.</span> [left, right)</h5>
<div class="outline-text-5" id="text-2-1-4-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #dcaeea;">right</span> = nums.size();
  <span style="color: #51afef;">while</span>(left &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &gt;= target) {
      right = mid;     <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right ... ] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      left = mid + <span style="color: #da8548; font-weight: bold;">1</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0 .. left-1] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left == right</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left - 1 or right - 1 are valid</span>
  <span style="color: #51afef;">return</span> left - <span style="color: #da8548; font-weight: bold;">1</span>;
}
</pre>
</div>

<p>
(left, right)
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>(<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #ECBE7B;">int</span>&gt;&amp; <span style="color: #dcaeea;">nums</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">target</span>) {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = -<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #dcaeea;">right</span> = nums.size();
  <span style="color: #51afef;">while</span>(left+<span style="color: #da8548; font-weight: bold;">1</span> &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (right - left) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(nums[mid] &gt;= target) {
      right = mid;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right ... ] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      left = mid;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0...left] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left+1 = right</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left and right - 1 are valid, return any is ok</span>
  <span style="color: #51afef;">return</span> left;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb860a47" class="outline-4">
<h4 id="orgb860a47"><span class="section-number-4">2.1.5.</span> first smaller (does not make sense to use binary search)</h4>
</div>
<div id="outline-container-org8cfb765" class="outline-4">
<h4 id="org8cfb765"><span class="section-number-4">2.1.6.</span> first smaller or equal (does not make sense to use binary search)</h4>
</div>
</div>
<div id="outline-container-org147c957" class="outline-3">
<h3 id="org147c957"><span class="section-number-3">2.2.</span> desending ordered array</h3>
<div class="outline-text-3" id="text-2-2">
<p>
for desending order, we need to overwrite the comparator operator
</p>
</div>
<div id="outline-container-org154a132" class="outline-4">
<h4 id="org154a132"><span class="section-number-4">2.2.1.</span> first smaller or equal (lower bound)</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
lower<sub>bound</sub>(nums.begin(), nums.end(), target, greater&lt;int&gt;())
</p>
</div>
</div>
<div id="outline-container-orgfeab1ac" class="outline-4">
<h4 id="orgfeab1ac"><span class="section-number-4">2.2.2.</span> first smaller (upper bound)</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
upper<sub>bound</sub>(nums.begin(), nums.end(), target, greater&lt;int&gt;())
</p>
</div>
</div>
<div id="outline-container-org361f725" class="outline-4">
<h4 id="org361f725"><span class="section-number-4">2.2.3.</span> last greater or eqaul</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
upper<sub>bound</sub>(nums.begin(), nums.end(), greater&lt;int&gt;()) - 1
</p>
</div>
</div>
<div id="outline-container-orgb41b2ee" class="outline-4">
<h4 id="orgb41b2ee"><span class="section-number-4">2.2.4.</span> last greater</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
lower<sub>bound</sub>(nums.begin(), nums.end(), greater&lt;int&gt;)
</p>
</div>
</div>
<div id="outline-container-org151e886" class="outline-4">
<h4 id="org151e886"><span class="section-number-4">2.2.5.</span> first greater (does not make sense to use binary search)</h4>
</div>
<div id="outline-container-orgc31dd39" class="outline-4">
<h4 id="orgc31dd39"><span class="section-number-4">2.2.6.</span> first greater or equal (does not make sense to use binary search)</h4>
</div>
</div>
<div id="outline-container-orgf7872a5" class="outline-3">
<h3 id="orgf7872a5"><span class="section-number-3">2.3.</span> paramatric search</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Parametric Search is a technique where you use binary search to find the smallest or largest value (parameter) that satisfies a given condition — even when the value itself isn&rsquo;t in a list or array.
For example, you want find the largest value k that can be used to finish something.
You can one helper function is<sub>ok</sub>(k), which returns true if k can be used to finish that thing
</p>

<p>
(left, right)
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">search</span>() {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">left</span> = -<span style="color: #da8548; font-weight: bold;">1</span> (<span style="color: #51afef;">or</span> other impossible value), <span style="color: #dcaeea;">right</span> = INT_MAX (<span style="color: #51afef;">or</span> other impossible value);
  <span style="color: #51afef;">while</span>(left+<span style="color: #da8548; font-weight: bold;">1</span> &lt; right) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">mid</span> = left + (left - right) / <span style="color: #da8548; font-weight: bold;">2</span>;
    <span style="color: #51afef;">if</span>(<span style="color: #51afef; font-weight: bold;">!</span>is_ok(mid)) {
      right = mid;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[right ... ] are invalid</span>
    }
    <span style="color: #51afef;">else</span> {
      left = mid <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[0.. left] are valid</span>
    }
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">now left+1 == right</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">left and right - 1 is valid, return either is ok</span>
  <span style="color: #51afef;">return</span> left;
}
</pre>
</div>
</div>
</div>
</div>
